# MullionTypeSet Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MullionTypeSet Methods
MullionTypeSet Class See Also
---
The MullionTypeSet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every mullion type from the set, rendering it empty. |
| Contains | Tests for the existence of a mullion type within the set. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Erase | Removes a specified mullion type from the set. |
| ForwardIterator | Retrieve a forward moving iterator to the set. |
| GetEnumerator | Retrieve a forward moving iterator to the set. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Insert | Insert the specified mullion type into the set. |
| ReverseIterator | Retrieve a backward moving iterator to the set. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace